sob = input('собирающая(s) или рассеивающая(r):')
def linz(sob):
  d = int(input('Расстояние от предмета до линзы:'))
  F = int(input('Фокусное расстояние линзы:'))
  if sob == 's':
    if d>2*F:
      t = 'уменьшенное, действительное, обратное'
    elif F<d<2*F:
      t = 'увеличенное, действительное, обратное'
    elif d<F:
      t = 'увеличенное, мнимое, прямое'
  elif sob == 'r':
    if d>2*F:
      t = 'уменьшенное, мнимое, прямое'
    elif F<d<2*F:
      t = 'уменьшенное, мнимое, прямое'
    elif d<F:
      t = 'уменьшенное, мнимое, прямое'
  print(t)
if sob == 's':
  linz('s')
elif sob == 'r':
  linz('r')
